app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
    def index
        @list = List.all

INSERT INTO "lists" ("task", "status", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["task", "tetsing the create function"], ["status", "outgoing"], ["user_id", 1], ["created_at", "2022-02-20 18:08:36.008635"], ["updated_at", "2022-02-20 18:08:36.008635"]]
---
    def create
        @newList = List.new(list_param)
        @newList.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 4]]
---
    def destroy
        @currList = List.find_by_id(params[:id])
        @currList.destroy

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "lists" SET "task" = ?, "status" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["task", "THIS IS AN UPDATED VERSION"], ["status", "done"], ["updated_at", "2022-02-27 14:26:26.747110"], ["id", 9]]
---
    def update
        @specificList = List.find_by_id(params[:id])
        @specificList.update(task:"THIS IS AN UPDATED VERSION",status:"done")